const express = require('express');
const app = express();

const phrases = [
    "Фраза 1",
    "Фраза 2",
    "Фраза 3",
    "Фраза 4",
    "Фраза 5",
    "Фраза 6",
    "Фраза 7",
    "Фраза 8",
    "Фраза 9",
    "Фраза 10",
    "Фраза 11",
    "Фраза 12",
    "Фраза 13",
    "Фраза 14",
    "Фраза 15",
    "Фраза 16",
    "Фраза 17",
    "Фраза 18",
    "Фраза 19",
    "Фраза 20",
    "Фраза 21",
    "Фраза 22",
    "Фраза 23",
    "Фраза 24",
    "Фраза 25",
    "Фраза 26",
    "Фраза 27",
    "Фраза 28",
    "Фраза 29",
    "Фраза 30",
    "Фраза 31",
    "Фраза 32",
    "Фраза 33",
    "Фраза 34",
    "Фраза 35",
    "Фраза 36",
    "Фраза 37",
    "Фраза 38",
    "Фраза 39",
    "Фраза 40",
    "Фраза 41",
    "Фраза 42",
    "Фраза 43",
    "Фраза 44",
    "Фраза 45",
    "Фраза 46",
    "Фраза 47",
    "Фраза 48",
    "Фраза 49",
    "Фраза 50"
];

app.get('/random', (req, res) => {
    const randomIndex = Math.floor(Math.random() * phrases.length);
    res.json({ content: phrases[randomIndex] });
});

app.listen(5001, () => {
    console.log('Server is running on port 5001');
});
